cnoviello/stm32-nucleof4/stm32-nucleof4-bluenrg-ex1/bluenrg-stack/Middlewares/ST/STM32_BlueNRG/SimpleBlueNRG_HCI/hci/hci.c
  Clear_SPI_EXTI_Flag();
  while(BlueNRG_DataPresent()){        
    if (list_is_empty (&hciReadPktPool) == FALSE){
            
      /* enqueueing a packet for read */
      list_remove_head (&hciReadPktPool, (tListNode **)&hciReadPacket);
            
      data_len = BlueNRG_SPI_Read_All(&SpiHandle, hciReadPacket->dataBuff, HCI_PACKET_SIZE);
      if(data_len > 0){                    
	HCI_Input(hciReadPacket);
	// Packet will be inserted to te correct queue by 
      }
      else {
	// Insert the packet back into the pool.
	list_insert_head(&hciReadPktPool, (tListNode *)hciReadPacket);
      }
            
    }
    else{
      // HCI Read Packet Pool is empty, wait for a free packet.
      readPacketListFull = TRUE;
      Clear_SPI_EXTI_Flag();
      return;
    }
        
    Clear_SPI_EXTI_Flag();
  }
}

void hci_write(const void* data1, const void* data2, uint16_t n_bytes1, uint16_t n_bytes2){
#if  HCI_LOG_ON
  PRINTF("HCI <- ");
  for(int i=0; i < n_bytes1; i++)
    PRINTF("%02X ", *((uint8_t*)data1 + i));
  for(int i=0; i < n_bytes2; i++)
    PRINTF("%02X ", *((uint8_t*)data2 + i));
  PRINTF("\n");    
#endif
  
  Hal_Write_Serial(data1, data2, n_bytes1, n_bytes2);
}

int hci_send_cmd(uint16_t ogf, uint16_t ocf, uint8_t plen, void *param)
{
	hci_command_hdr hc;

	hc.opcode = htobs(cmd_opcode_pack(ogf, ocf));
	hc.plen= plen;
	
	uint8_t header[HCI_HDR_SIZE + HCI_COMMAND_HDR_SIZE];
	header[0] = HCI_COMMAND_PKT;
	Osal_MemCpy(header+1, &hc, sizeof(hc));
    
	hci_write(header, param, sizeof(header), plen);

	return 0;
}

static uint8_t new_packet;

void new_hci_event(void *pckt, uint16_t len)
{
	Disable_SPI_IRQ(); /* Must be re-enabled after packet processing. */

	new_packet = TRUE;
}

/* 'to' is timeout in system clock ticks.  */
int hci_send_req(struct hci_request *r)
{
	uint8_t *ptr;
	uint16_t opcode = htobs(cmd_opcode_pack(r->ogf, r->ocf));
	hci_event_pckt *event_pckt;
	hci_uart_pckt *hci_hdr;
	int try;
    int to = DEFAULT_TIMEOUT;
    
	new_packet = FALSE;
	hci_set_packet_complete_callback(new_hci_event);
	if (hci_send_cmd(r->ogf, r->ocf, r->clen, r->cparam) < 0)
		goto failed;
    
	try = 10;
	while (try--) {
		evt_cmd_complete *cc;
		evt_cmd_status *cs;
		evt_le_meta_event *me;
		int len;
        
        /* Minimum timeout is 1. */
        if(to == 0)
            to = 1;
        
		if (to > 0) {
			struct timer t;
            
			Timer_Set(&t, to);
            
			while(1){
				if(Timer_Expired(&t)){
					goto failed;
				}
				if(new_packet){
					break;
				}
			}
		}
        
		hci_hdr = (void *)hci_buffer;
		if(hci_hdr->type != HCI_EVENT_PKT){
            new_packet = FALSE;
            Enable_SPI_IRQ();
            continue;
        }
        
		event_pckt = (void *) (hci_hdr->data);
        
		ptr = hci_buffer + (1 + HCI_EVENT_HDR_SIZE);
		len = hci_pckt_len - (1 + HCI_EVENT_HDR_SIZE);
        
		switch (event_pckt->evt) {
            
		case EVT_CMD_STATUS:
			cs = (void *) ptr;
            
			if (cs->opcode != opcode)
				break;
            
			if (r->event != EVT_CMD_STATUS) {
				if (cs->status) {
					goto failed;
				}
				break;
			}
            
			r->rlen = MIN(len, r->rlen);
			Osal_MemCpy(r->rparam, ptr, r->rlen);
			goto done;
            
		case EVT_CMD_COMPLETE:
			cc = (void *) ptr;
            
			if (cc->opcode != opcode)
				break;
            
			ptr += EVT_CMD_COMPLETE_SIZE;
			len -= EVT_CMD_COMPLETE_SIZE;
            
			r->rlen = MIN(len, r->rlen);
			Osal_MemCpy(r->rparam, ptr, r->rlen);
			goto done;
            
		case EVT_LE_META_EVENT:
			me = (void *) ptr;
            
			if (me->subevent != r->event)
				break;
            
			len -= 1;
			r->rlen = MIN(len, r->rlen);
			Osal_MemCpy(r->rparam, me->data, r->rlen);
			goto done;
            
        case EVT_HARDWARE_ERROR:            
            goto failed;
            
		default:
            break; // In the meantime there could be other events from the controller.
		}
        
		new_packet = FALSE;
		Enable_SPI_IRQ();
        
	}
    
failed:
	hci_set_packet_complete_callback(NULL);
	Enable_SPI_IRQ();
	return -1;
    
done:
	hci_set_packet_complete_callback(NULL);
	Enable_SPI_IRQ();
	return 0;
}

int hci_reset()
{
  	struct hci_request rq;
	uint8_t status;

	Osal_MemSet(&rq, 0, sizeof(rq));
	rq.ogf = OGF_HOST_CTL;
	rq.ocf = OCF_RESET;
	rq.rparam = &status;
	rq.rlen = 1;

	if (hci_send_req(&rq) < 0)
		return -1;

	if (status) {
		return -1;
	}

	return 0;  
}

int hci_disconnect(uint16_t	handle, uint8_t reason)
{
  struct hci_request rq;
	disconnect_cp cp;
	uint8_t status;
  
	cp.handle = handle;
	cp.reason = reason;

	Osal_MemSet(&rq, 0, sizeof(rq));
	rq.ogf = OGF_LINK_CTL;
	rq.ocf = OCF_DISCONNECT;
    rq.cparam = &cp;
	rq.clen = DISCONNECT_CP_SIZE;
    rq.event = EVT_CMD_STATUS;
	rq.rparam = &status;
	rq.rlen = 1;

	if (hci_send_req(&rq) < 0)
		return -1;

	if (status) {
		return -1;
	}

	return 0;  
}

int hci_le_read_local_version(uint8_t *hci_version, uint16_t *hci_revision, uint8_t *lmp_pal_version, 
			      uint16_t *manufacturer_name, uint16_t *lmp_pal_subversion)
{
	struct hci_request rq;
	read_local_version_rp resp;

	Osal_MemSet(&resp, 0, sizeof(resp));

	Osal_MemSet(&rq, 0, sizeof(rq));
	rq.ogf = OGF_INFO_PARAM;
	rq.ocf = OCF_READ_LOCAL_VERSION;
	rq.cparam = NULL;
	rq.clen = 0;
	rq.rparam = &resp;
	rq.rlen = READ_LOCAL_VERSION_RP_SIZE;

	if (hci_send_req(&rq) < 0)
		return -1;

	if (resp.status) {
		return -1;
	}


	*hci_version = resp.hci_version;
	*hci_revision =  btohs(resp.hci_revision);
	*lmp_pal_version = resp.lmp_pal_version;
	*manufacturer_name = btohs(resp.manufacturer_name);
	*lmp_pal_subversion = btohs(resp.lmp_pal_subversion);

	return 0;
}

int hci_le_read_buffer_size(uint16_t *pkt_len, uint8_t *max_pkt)
{
	struct hci_request rq;
	le_read_buffer_size_rp resp;

